Tekla Open API Reference for Tekla Structures 2025
IEvents.ClipPlaneChanged Event
 Occurs when clip plane is changed.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.ClipPlaneChangedDelegate ClipPlaneChanged
Event ClipPlaneChanged As Events.ClipPlaneChangedDelegate
Value
Type: Tekla.Structures.Model.Events.ClipPlaneChangedDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace